/*
Напишите программу, выводящую "Hello, World!". Можно скопировать ее из конспекта.
*/

#include <iostream>

using namespace std;
int main() {
    cout << "Hello, World!";
    
    return 0;
}
